load-tests/test.yml
config:
  target: "<the target url>"

  socketio:
    transports:
      - "websocket"
    upgrade: false
    forceNew: true
    extraHeaders:
      Authorization: "Bearer <your token>"

  engines:
    socketio: {}

  plugins:
    metrics-by-endpoint: { useOnlyRequestNames: true }

  phases:
    - name: "Warm up"
      duration: 10
      arrivalRate: 10
    - name: "Ramp up to stress point"
      duration: 60
      arrivalRate: 10
      rampTo: 25

  processor: "./processor.js"

  variables:
    token: "<your token>"

scenarios:
  - name: "Hybrid POST + Strict WebSocket Flow"
    engine: socketio
    flow:
      - function: "generatePayload"
      - post:
          url: "/query"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json: "{{ payload }}"
          capture:
            - json: "$.annotation_id"
              as: "annotation_id"
      - emit:
          channel: "join"
          data:
            room: "{{ annotation_id }}"
      - function: "waitForCompletion"